{
  "textVideo": {
    "videoOverlay": "Will Brammer",
    "videoOverlaySubtext": "Software Engineer, baseball enthusiast, gamer"
  },
  "aboutMe": {
    "youtubeUrl": "https://www.youtube.com/watch?v=lMnKuDn0Z3Q&feature=youtu.be",
    "nameAndLocation": "My name is Will Brammer. I am originally from the U.S., but am currently living in Japan.",
    "interests": "When it comes to what I am interested in, I think it is impossible for me to list it all here. So a very short synopsis would be that in terms of tech, all of it excites and interests me. There are endless possibilities for learning and creativity. Personally, I love sports (baseball the most) and games.",
    "workExperience": "I currently work freelance as a Software Engineer to help companies build their tech branches internally and externally. Along with my freelance work, I intern at a multiple companies that work within an AGILE developement environment, while learning from industry veterans and mentor newer junior engineers. I am not only a Software Engineer, but tech communicator as I teach beginners the basics of JavaScript for Code Chrysalis."
  },
  "workProjects": {
    "javco": {
      "companyName": "Javco",
      "role": "Full Stack Engineer (Freelance)",
      "about": "Javco specializes in semi-trailer sales and rentals with a large presence in Wisconsin.",
      "projectDetails": "I led the discovery and research to build a frontend website for the client in order to improve their SEO. Before the project they did not even display on the first page of Google. Now in the U.S. they are listed first when typing their name. Currently, I am adding CMS for the customer so they can update their inventory. I continue to research and revamp the website in order to improve SEO results.",
      "techUsed": {
        "Next.js": "/next.svg",
        "TypeScript": "/typescript.svg",
        "Tailwind": "/tailwind.svg",
        "Node.js": "/node.svg",
        "Express": "/express.svg",
        "Vercel": "/vercel.svg",
        "MongoDB": "/mongodb.svg"
      }
    },
    "daizen": {
      "companyName": "Daizen",
      "role": "Full Stack Developer (Freelance)",
      "about": "Daizen provides tailored logistics solutions depending on your unique requirements.",
      "projectDetails": "The company which has been more traditional relying on paper for communication, is in a transition of revamping their internal system to be digital. My team is building this system from the ground up, using client requirements and meeting with their manager of this transition to build a user-friendly, streamlined application that can improve employees' lives.",
      "techUsed": {
        "React": "/react.svg",
        "Tailwind": "/tailwind.svg",
        "TypeScript": "/typescript.svg",
        "Python": "/python.svg",
        "Flask": "/flask.svg",
        "PostgreSQL": "/postgresql.svg",
        "Cypress": "/cypress.svg",
        "Heroku": "/heroku.svg",
        "Vercel": "/vercel.svg",
        "Node.js": "/node.svg"
      }
    },
    "codeChrysalis": {
      "companyName": "Code Chrysalis",
      "role": "Technical Instructor",
      "about": "Code Chrysalis is a coding bootcamp located in downtown Toyko that provides classes to beginners and aspiring Software Engineers.",
      "projectDetails": "I teach and mentor aspiring junior developers in the basics of JavaScript, CSS, and HTML.",
      "techUsed": {
        "JavaScript": "/javascript.svg",
        "HTML": "/html5.svg",
        "CSS": "/css3.svg"
      }
    },
    "findAdoc": {
      "companyName": "Find a Doc",
      "role": "Frontend Developer (Open Source Volunteer)",
      "about": "Find a Doc is an NPO aimed at helping non native Japanese speakers find a doctor who can communicate to them in their native language.",
      "projectDetails": "Going to the doctor is always stressful, so whether traveling or living in Japan, Find a Doc can hopefully ease the stress of communciation. I work closely with the Tech Lead, Project Manager, and design team to implement new features due to the requirements on each ticket that is tracked on Github issues.",
      "techUsed": {
        "Vue": "/vue.svg",
        "TypeScript": "/typescript.svg",
        "Tailwind": "/tailwind.svg",
        "GraphQL": "/graphql.svg",
        "Cypress": "/cypress.svg",
        "Node.js": "/node.svg",
        "Yarn": "/yarn.svg",
        "Pinia": "/pinia.svg"
      }
    },
    "sustainabilityPage": {
      "companyName": "Sustainability Page",
      "role": "Frontend Developer (Intern)",
      "about": "Sustainability Page is aimed at assisting companies to make sustainability in their organization the norm, not an afterthought.",
      "projectDetails": "I work with the Product Owner and the Frontend Leads to quickly and efficiently implement UI changes. The aim is to efficiently use our API to benefit the user experience in a manner that can be tested using Cypress.",
      "techUsed": {
        "Next.js": "/next.svg",
        "TypeScript": "/typescript.svg",
        "Tailwind": "/tailwind.svg",
        "Yarn": "/yarn.svg",
        "Python": "/python.svg",
        "Django": "/django.svg",
        "Cypress": "/cypress.svg"
      }
    }
  },
  "techPics": {
    "Frontend": {
      "React": "/react.svg",
      "Next": "/next.svg",
      "Vue": "/vue.svg",
      "HTML": "/html5.svg",
      "CSS": "/css3.svg",
      "Tailwind": "/tailwind.svg",
      "Pinia": "/pinia.svg"
    },
    "BackendAndDB": {
      "Node": "/node.svg",
      "Yarn": "/yarn.svg",
      "Express": "/express.svg",
      "GraphQL": "/graphql.svg",
      "PostgreSQL": "/postgresql.svg",
      "MongoDB": "/mongodb.svg",
      "Prisma": "/prisma.svg",
      "Knex": "/knex.svg"
    },
    "Languages": {
      "JavaScript": "/javascript.svg",
      "TypeScript": "/typescript.svg",
      "Python": "/python.svg"
    },
    "TestingAndDeployment": {
      "Heroku": "/heroku.svg",
      "Vercel": "/vercel.svg",
      "Render": "/render.svg",
      "Pytest": "/pytest.svg",
      "Cypress": "/cypress.svg",
      "Github": "/github.svg",
      "Git": "/git.svg"
    }
  }
}
